@echo off
rem -------------------------------------------------------------------
rem git tag %Tag%
rem -------------------------------------------------------------------
chcp 1251

rem -------------------------------------------------------------------
:P1
if "%1" == "" goto P1_Input
goto Begin
:P1_Input
set /p Tag=Tag:
if "%Tag%" == "" goto P1_Error
goto Begin
:P1_Error
echo Значение параметра Tag не установлено
goto Exit
rem -------------------------------------------------------------------

:begin
git tag %Tag%

:Exit
